{
  "headline": {
    "en": "AI-Powered Administrative Scrivener | Japan Company Formation & Visa Services",
    "jp": "AI活用 行政書士｜日本での会社設立・ビザ申請支援"
  },
  "about": {
    "en": "I help international founders, executives, and investors launch and scale in Japan with precision, speed, and confidence. Whether you are registering a K.K. or G.K., opening a bank account, obtaining a Business Manager Visa, or restructuring after investment, I guide you through every step with bilingual clarity and regulatory accuracy. As a licensed Administrative Scrivener (Gyoseishoshi), I bring 15+ years of cross-border practice and a proven record of 500+ successful company formations, visa approvals, and corporate changes. My approach blends deep legal-operational expertise with AI-driven delivery. Drafting, translation, and compliance checks are automated and quality-controlled, enabling standard incorporations and common visa applications to be completed within 48 hours. You get fewer back-and-forths, cleaner document sets, and predictable outcomes. I partner closely with tax accountants, judicial scriveners, and banks to ensure end-to-end readiness—from articles of incorporation and seal registration to tax filings and payroll onboarding. Clients choose me for strategic insight as much as execution. I advise on entity selection (K.K. vs G.K.), share structure, capital planning, director residency, registered address, and governance frameworks fit for fundraising and M&A. For immigration, I structure robust business plans, revenue models, and hiring roadmaps that satisfy examiners while supporting long-term growth. Clear timelines, fixed-fee options, and transparent checklists keep your team aligned. If you need a reliable, tech-enabled partner for Japan entry or expansion, I am ready to deliver fast, compliant results.",
    "jp": "海外企業・起業家・投資家の日本進出を、正確かつ迅速に伴走支援します。K.K.（株式会社）やG.K.（合同会社）の設立、銀行口座開設、ビジネスマネージャー在留資格の取得、投資後の組織再編まで、日英バイリンガルで要点を整理し、手戻りのない形で前進させます。行政書士として15年以上の実務経験、累計500件超の会社設立・在留資格許可・各種変更手続の実績にもとづき、実務と審査基準の双方に強い支援を提供します。AIを組み込んだワークフローにより、ドラフト作成・訳文整備・適法性チェックを自動化し、標準的な案件は最短48時間で完了可能。やり取りを最小化しつつ、整った書類一式を短時間でご用意します。税理士・司法書士・金融機関とも連携し、定款・印鑑届・各種届出から税務・給与まで、ワンストップで立ち上げを支援します。会社設立では、K.K./G.K.の選択、株式・持分設計、資本金計画、役員要件、住所・ガバナンス体制など、資金調達やM&Aを見据えた構成をご提案。ビザでは、事業計画・売上モデル・採用計画を審査目線で再設計し、実現可能性と持続性をバランス良く示します。明確なスケジュール、固定報酬の選択肢、透明なチェックリストで、関係者の合意形成を素早く進めます。日本展開の確度とスピードを両立したい方は、ぜひご相談ください。"
  },
  "services": [
    {
      "name": "Company formation",
      "name_jp": "会社設立",
      "priority": 1,
      "description_en": "Complete incorporation for KK or GK, governance setup, bank coordination, seals and registrations. AI assisted drafting with 48 hour turnaround for standard cases.",
      "description_jp": "株式会社/合同会社の設立を起点に、機関設計・銀行連携・印鑑/各種届出までを一気通貫で支援。標準案件は48時間での迅速対応に対応。"
    },
    {
      "name": "Visa applications",
      "name_jp": "在留資格申請",
      "priority": 2,
      "description_en": "Business Manager, Startup and work visas with evidence led plans, bilingual documentation and examiner aligned narratives for high approval rates.",
      "description_jp": "経営・管理、スタートアップ、就労系などの在留資格について、根拠資料と説得力ある計画で高い許可率を目指す申請書類を作成。"
    }
  ],
  "keywords": [
    "Japan company setup",
    "business manager visa",
    "startup visa",
    "M&A advisory"
  ]
}


